Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/small_claims_court.html.txt.tmx
Source language: en
Languages: ga

source: The aim of the small claims procedure (also known as the small claims court) is to provide an inexpensive, fast and easy way for consumers and businesses to resolve disputes without the need to employ a solicitor
ga: Is í aidhm an nóis imeachta mionéileamh (ar a dtugtar an chúirt mhionéileamh) chun bealach neamhchostasach, tapa agus furasta a sholáthar do thomhaltóirí agus do ghnólachtaí chun díospóidí a réiteach gan an gá a bheith le haturnae a fhostú

source: The person who is making the claim is known as the claimant
ga: Tugtar an t-éilitheoir ar an duine a dhéanann an éileamh

source: The person you are claiming against is known as the respondent
ga: Tugtar an freagróir ar an duine a ndéanann tú éileamh ina leith

source: Both the claimant and the respondent must be living or based within the State
ga: Caithfidh an t-éilitheoir agus an freagróir araon a bheith ina gcónaí nó bunaithe sa Stát

source: If either party lives or is based in another EU member state, the European Small Claims Procedure should be used
ga: Má chónaíonn nó má tá ceachtar páirtí bunaithe i mballstát eile an AE, ba cheart an Nós Imeachta Eorpach Mionéileamh a úsáid

source: The small claims procedure is provided by the local District Court offices
ga: Soláthraíonn oifigí na Cúirte Dúiche áitiúla an nós imeachta mionéileamh

source: The procedure can be used to resolve consumer complaints
ga: Is féidir an nós imeachta a úsáid chun gearáin ó thomhaltóirí a réiteach

source: Certain other types of disputes are also eligible
ga: Chomh maith leis sin, tá saghsanna áirithe eile de dhíospóidí incháilithe

source: Since January 2010, businesses can make claims against other businesses
ga: Ó Eanáir 2010 ar aghaidh, féadfaidh gnólachtaí éilimh a dhéanamh i gcoinne gnólachtaí eile

source: The claim cannot exceed €2,000
ga: Ní féidir leis an éileamh €2,000 a shárú

source: The following types of consumer claims can be dealt with under the small claims procedure:
ga: Is féidir na cineálacha éilimh seo a leanas a láimhseáil faoi nós imeachta na néileamh bheaga:

source: • Consumer claims such as for faulty goods or bad workmanship
ga: • Éilimh ó thomhaltóirí i leith earraí lochtacha nó droch-shaoirseacht, mar shampla

source: You must have bought the goods or service for private use from someone selling them in the course of business
ga: Ní mór duit na hearraí nó an tseirbhís a bheith ceannaithe agat i gcomhair úsáid phríobháideach ó dhuine a dhíolann iad mar chuid dá ngnó

source: • Claims can also be made for minor damage to your property
ga: • Is féidir éilimh a dhéanamh freisin i leith mion-dhamáiste ar do mhaoin

source: • Claims for the non-return of a rent deposit for certain kinds of rented properties, such as, a holiday home or a flat in a premises where the landlord also lives
ga: • Éilimh i gcomhair éarlais cíosa le haghaidh cineálacha áirithe maoine, cosúil le teach saoire nó árasán in áitreabh ina bhfuil cónaí ar an tiarna talún freisin, nár tugadh ar ais

source: Consumer claims cannot be made through the small claims procedure for debts, personal injuries or breach of leasing or hire-purchase agreements
ga: Ní féidir éilimh a dhéanamh i gcomhair fiacha, díobhálacha pearsanta nó sárú comhaontuithe léasaithe nó fhruilcheannaigh

source: Businesses can make claims against other businesses in relation to contracts for goods or services purchased
ga: Féadfaidh gnólachtaí éilimh a dhéanamh in aghaidh gnólachtaí eile maidir le conarthaí d’earraí nó do sheirbhísí a ceannaíodh

source: It does not apply to claims in relation to:
ga: Ní bhaineann sé le héilimh a rinneadh maidir leis an méid a leanas:

source: • Agreements to which the Consumer Credit Act 1995 applies
ga: • Comhaontuithe lena mbaineann an tAcht um Chreidmheas do Thomhaltóirí, 1995

source: • Breaches of leasing agreements
ga: • Sáruithe ar chomhaontuithe léasaithe

source: • Debt or liquidated damages
ga: • Fiachais nó damáistí leachtaithe

source: The procedure is designed to deal with claims up to €2,000 and can be summarised as follows:
ga: Tá an nós imeachta seo deartha chun éilimh thomhaltóirí suas le €2,000 a láimhseáil

source: • The claimant completes the application form and sends it to the Small Claims Registrar with the relevant fee or applies online
ga: • Líonann an t- éilitheoir an fhoirm iarratais isteach agus seoltar ar aghaidh í chuig an gCláraitheoir leis an táille cheart

source: • The application is registered by the Registrar
ga: • Cláraíonn an Cláraitheoir an t-iarratas

source: • A copy of the claim and a Notice of Claim is sent by the Registrar to the respondent
ga: • Cuireann an Cláraitheoir cóip den éileamh agus Fógra an Éilimh ar aghaidh chuig an bhfreagróir

source: At this stage, there are various choices available to the respondent:
ga: Tá cúpla rogha ag an bhfreagróir anois

source: • They can admit the claim
ga: • Is féidir an t-éileamh a admháil

source: • They can dispute the claim
ga: • Is féidir díospóid an t-éileamh

source: • They might ignore the claim
ga: • Is féidir gan aon aird a thabhairt don éileamh

source: Respondent admits the claim
ga: Nuair a aontaíonn an freagróir leis an éileamh

source: The respondent has 15 calendar days to reply
ga: Tá 15 lá tugtha don fhreagróir comhfhreagras a dhéanamh

source: Where the respondent admits the claim, they complete a Notice of Acceptance of Liability and return it to the Registrar
ga: Nuair a aontaíonn an freagróir leis an éileamh, líonann sé/sí isteach foirm Fógra Admhála ag glacadh Freagrachta agus cuireann é ar aghaidh chuig an gCláraitheoir

source: The respondent has 3 options:
ga: Tá 3 rogha ag an bhfreagróir:

source: The respondent agrees to pay the amount claimed
ga: Aontaíonn an freagróir, an suim atá a lorg a íoc

source: Here, the respondent agrees to pay you immediately
ga: Anseo tá an freagróir sásta tú a íoc láithreach

source: Payment is made by cheque, postal order or money order, made payable to the claimant, and sent to the Registrar
ga: Déantar an íocaíocht trí seic, ordú poist nó ordú airgid, bíonn sé in ainm an éilitheora ach é curtha ar aghaidh chuig an gCláraitheoir

source: If payment is conditional, for example the goods must be returned, then the Registrar must seek the claimant's agreement
ga: Má tá coinníollacha ag baint leis an íocaíocht mar shampla, go gcaithfear na hearraí a thabhairt ar ais, caithfidh an Cláraitheoir aontú a fháil ón éilitheoir

source: The respondent consents to judgement
ga: Aontaíonn an freagróir le breith

source: Here, the respondent will only pay you when judgement is made in the District Court
ga: Anseo íocfaidh an freagróir tú nuair atá breith déanta in an Chúirt Dúiche

source: You do not have to attend at court
ga: Ní chaithfidh tú freastal a dhéanamh ar an gcúirt

source: The claimant swears an Affidavit of Debt and makes a request for Judgement and Decree
ga: Mionaíonn an t-éilitheoir Fiacha Mionnscríbhinne agus déanann sé/sí iarratas do Bhreith agus Forógra

source: The Registrar will assist the claimant in this procedure
ga: Tabharfaidh an Cláraitheoir cúnamh don éilitheoir leis an gcóras seo

source: The Registrar will notify the respondent of the judgement
ga: Cuirfidh an Cláraitheoir an freagróir ar an eolas faoin mbreith

source: The respondent has 28 calendar days to comply with the judgement
ga: Tá 28 lá tugtha don fhreagróir leis an mbreith a chomhlíonadh

source: The respondent wishes to pay the amount claimed in instalments
ga: Tá an freagróir sásta an t-éileamh a íoc ar ghlasíocaíocht

source: The Registrar must inform the claimant of this request and must seek the consent of the claimant to the terms proposed
ga: Caithfidh an cláraitheoir, an t-éilitheoir a chur ar an eolas faoi agus cead a fháil glacadh leis na téarmaí atá molta

source: Respondent disputes the claim
ga: Nuair a dhíospóideann an freagróir an t-éileamh

source: The respondent has 15 calendar days to reply and returns to the Registrar the Notice of Dispute within the 15 calendar day period
ga: Tá 15 lá ag an bhfreagróir le scríobh ar ais chuig an gCláraitheoir leis an bhFógra Aighnis

source: The Registrar sends the claimant a copy of the Notice of Dispute and tries to settle the dispute
ga: Seolann an Cláraitheoir cóip den Fhógra Aighnis chuig an éilitheoir agus déanann sé/sí iarracht an t-aighneas a réiteach

source: If no settlement can be reached, the matter is then set down for a hearing in the District Court
ga: Téann an cás ar aghaidh chuig éisteacht sa Chúirt Dúiche muna dtagann siad ar réiteach

source: The respondent outlines their intention to counterclaim on the Notice of Dispute and sends the appropriate fee to the Registrar
ga: Déanann an freagróir cur síos ar an bhfrithéileamh, ar an bhFógra Aighnis agus seolann sé/sí ar aghaidh an táille chuí chuig an gCláraitheoir

source: The Registrar sends the claimant a copy of the Notice of Dispute and Counterclaim
ga: Cuireann an Cláraitheoir cóip den Fhógra Aighnis agus an Frithéileamh ar aghaidh chuig an éilitheoir

source: The respondent does not reply to the claim
ga: Nuair nach bhfreagraíonn an freagróir an t-éileamh

source: The respondent has 15 calendar days to reply to the claim
ga: Tá 15 lá tugtha don fhreagróir le comhfhreagras a dhéanamh

source: Where there is no reply by the respondent, they are then held to have admitted the claim
ga: Muna bhfuil freagra faighte ón bhfreagróir, tá sé glactha go bhfuil sé/sí ag admháil don éileamh

source: The procedure is the same as if they had consented to judgement
ga: Tá sé mar a bheadh sé/sí ag glacadh le breith

source: Once you have obtained judgement and have a decree, there is the possibility that the respondent will not comply with the order of the court
ga: Nuair atá breith tugtha agus forógra faighte agat, tá seans ann nach nglacfaidh an freagróir leis an ordú cúirte

source: In this situation, you may need to enforce your judgement
ga: Sa chás seo caithfidh tú an bhreith a bhrú

source: The most usual way of enforcing a judgement is to give the decree to the Sheriff or County Registrar for execution
ga: Is é an gnáth bhealach chuige sin ná an Foróga a thabhairt don Sirriam nó don Chláraitheoir Contae do fhorghníomhú

source: You have to apply to the Small Claims Registrar to have the decree sent to you
ga: Beidh ort iarratas a chur chuig an gCláraitheoir um Éilimh Bheaga ar an Foraithne a sheoladh chuig tú

source: The Registrar will not automatically send you the decree for execution in this way
ga: Ní bheidh an Cláraitheoir sheoladh go huathoibríoch tú an Foraithne maidir fhorghníomhú ar an mbealach seo

source: After you give the decree to the Sheriff or County Registrar, they then go to the respondent and seize goods or money to the value of the amount set out in your decree
ga: Tar éis a thabhairt duit an Foraithne chuig an Sirriam nó Cláraitheoir Contae, téann sé/sí ar aghaidh chuig an bhfreagróir agus glacann sé/sí seilbh ar earraí nó airgead atá ar an luach céanna leis an méid atá luaite san fhorógra

source: It will involve a fee, payable to the Sheriff or County Registrar
ga: Beidh táille a bheith iníoctha leis an Sirriam nó Cláraitheoir Contae

source: If the Sheriff or County Registrar successfully executes the judgement, this fee will be refunded to you
ga: Má éiríonn leis an Sirriam nó Cláraitheoir Contae an bhreith a chomhlíonadh, gheobhaidh tú an táille ar ais

source: Information and assistance on enforcement procedures is available from the Small Claims Registrar
ga: Tá faisnéis agus cúnamh maidir le nósanna imeachta forfheidhmiúcháin ar fáil ón gCláraitheoir um Éilimh Bheaga

source: If your case has been referred for a hearing in the District Court, you will receive a letter from the District Court office telling you the date and time of the court hearing and the location of the court itself
ga: Má atreoraíodh do chás d’éisteacht sa Chúirt Dúiche, gheobhaidh tú litir ó oifig na Cúirte Dúiche a chuireann ar an eolas thú ar dháta agus ar am éisteacht na cúirte agus ar láthair na cúirte féin

source: The case will be heard in public as part of a normal sitting of the District Court
ga: Éistfear leis an gcás go poiblí mar chuid de ghnáthshuí na Cúirte Dúiche

source: It may be advisable to get legal advice
ga: B’fhéidir gur fearr duit comhairle dlí a fháil

source: Under Irish law, a business is required to be legally represented in court-based proceedings
ga: Faoi dhlí na hÉireann, is gá ionadaíocht dlí a dhéanamh do ghnólacht in imeachtaí atá bunaithe i gcúirt

source: The current fee for making a claim through the small claims procedure is €25
ga: Is í an táille reatha atá ar éileamh a dhéanamh tríd an nós imeachta mionéileamh ná €25

source: This fee is payable by cheque or postal order
ga: Is féidir an táille a íoc trí sheic nó ordú poist

source: The Small Claims Registrar will accept the fee in cash if you pay it in person
ga: Glacfaidh an Cláraitheoir Mionéileamh leis an táille in airgead tirim má íocann tú as i bpearsan

source: If you apply online, you are required to pay online
ga: Má dhéanann tú iarratas ar líne, tá ort íoc ar líne

source: If your claim is accepted as suitable for the small claims procedure the fee is not refunded, even if your claim is successful
ga: Má ghlactar le d’éileamh amhail bheith oiriúnach don nós imeachta mionéileamh, ní dhéantar an táille a aisíoc, fiú má éiríonn le d’éileamh

source: Download an application for the small claims procedure
ga: Íoslódáil foirm iarratais don nós imeachta um éilimh bheaga

source: (You can complete this form by filling it in on the screen and printing it, or by printing it and completing it by hand
ga: (Is féidir leat an fhoirm seo a chomhlánú ar an scáileán agus í a phriontáil, nó í a phriontáil agus a chomhlánú de láimh)

source: This application form is also available from local District Court offices
ga: Tá an fhoirm iarratais seo ar fáil ó oifigí Cúirte Dúiche áitiúil freisin

source: Staff in the District Court office can help in completing the application form
ga: Is féidir leis an bhfoireann oibre i d’oifig Cúirte Dúiche cabhrú leat an fhoirm iarratais a chomhlánú

source: It is important when completing the application form to give all the necessary information
ga: Tá sé tábhachtach nuair a chomhlánaíonn tú an fhoirm iarratais an fhaisnéis riachtanach go léir a thabhairt

source: This will help the Small Claims Registrar to process your claim and try and resolve the dispute
ga: Cabhróidh sé seo le Cláraitheoir na nÉileamh Beag d’éileamh a phróiseáil agus iarracht a dhéanamh an díospóid a réiteach

source: If no resolution can be reached, it will also make it easier to enforce a Decree (or court order) if one is granted
ga: Murar féidir a theacht ar réiteach, beidh sé níos furasta Foraithne (nó ordú cúirte) a fhorghníomhú má bhronntar ceann

source: You can find more on completing the application form in ‘Further information’ below
ga: Is féidir leat a fháil faoi chomhlánú na foirme iarratais in ‘Tuilleadh eolais’ thíos

source: You can also make an application for the small claims procedure online
ga: Is féidir leat iarratas ar nós imeachta na n-éileamh beag a lóisteáil sa Chúirt Dúiche ar líne

source: Using Courts Service Online you can create and pay for a small claim application
ga: Trí úsáid a bhaint as Seirbhís Chúirteanna Ar Líne is féidir leat iarratas d’éilimh bheaga a chruthú agus a íoc

source: You can also check the status of your online small claim securely, using a username and password
ga: Is féidir leat an stádas atá ag d’éileamh beag ar líne a sheiceáil go slán freisin trí úsáid a bhaint as ainm úsáideora agus phasfhocal

source: To create a claim online you need a credit or debit card and an email address to which you have access
ga: Chun éileamh a chruthú ar líne, teastóidh cárta creidmheasa/dochair uait agus seoladh ríomhphoist a bhfuil rochtain agat air

source: The small claims procedure is provided through local District Court offices
ga: Déantar nós imeachta um éileamh bheaga a sholáthar tríd oifigí na Cúirte Dúiche áitiúil

source: You make your claim to the District Court office in the area where:
ga: A dhéanamh leat d'éileamh chuig an oifig na Cúirte Dúiche sa cheantar ina:

source: • The person you are making a claim against lives or carries on business or
ga: • Déanann an duine a bhfuil tú ag déanamh éilimh i gcoinne saol nó gnó nó

source: • Where the contract was made or
ga: • I gcás ina ndearnadh an conradh nó

source: • Where the damage to property took place
ga: • I gcás ghlac an damáiste do mhaoin ar siúl

source: You will find a list of district court areas on the Court Service website
ga: Gheobhaidh tú liosta de na ceantair chúirte dúiche agus líon dúiche ar láithreán gréasáin na Seirbhíse Cúirteanna

source: The Courts Service has information on the small claims procedure on its website
ga: Tá treoir faoi nós imeachta um éilimh bheaga ar láithreán gréasáin na Seirbhíse Cúirteanna

source: Completing the application form
ga: Ag Líonadh isteach an Fhoirm Iarratais

source: Before you begin to fill in the application form, the following information will be useful to help explain the various parts of the form
ga: Sula dtosaíonn tú, beidh an fhaisnéis seo a leanas úsáideach chun cabhair a thabhairt duit roinnt codanna den fhoirm a mhíniú

source: There are 3 distinct sections to the form
ga: Tá 3 ranná ar beith san fhoirm

source: The person taking the claim is the claimant
ga: Is é an duine atá ag déanamh an éilimh an t-éilitheoir

source: This section is for your personal details
ga: Is sonraí pearsanta atá sa roinn seo amháin

source: Here you should enter your name and address
ga: Ba cheart duit d'ainm agus do sheoladh a bhreacadh síos anseo

source: It is important to make sure that the correct person is making the claim
ga: Tá sé an-tábhachtach gurb é an duine ceart atá ag déanamh an éilimh

source: The person who bought the faulty goods or the person who ordered the work to be carried out should be the one to take the claim
ga: Ba cheart gurb é an duine a cheannaigh na hearraí lochtacha nó an duine a d'ordaigh an obair déanta a dhéanann an t-éileamh

source: Likewise, the person whose property has been damaged should be the one making the claim
ga: Mar a chéile is é an duine ar ar dearnadh dochar dá áitreabh nó a bhí ag tógaint áite ar chíos a dhéanann an t-éileamh

source: This section is for the details of the person or company you are making the claim against
ga: Sa roinn seo tá cur síos ar an duine nó an comhlacht ar a bhfuil tú ag déanamh an éilimh

source: You must make the claim against a person or a company
ga: Caithfidh tú an t-éileamh a dhéanamh in aghaidh duine nó comhlachta

source: Often you may not know who owns the shop you bought the faulty goods from
ga: I gcuid mhaith de na cásanna ní bhíonn a fhios agat cé leis an siopa ar cheannaigh tú na hearraí lochtacha uaidh

source: It is not enough to just put the name of the shop on the application form
ga: Ní leor é ainm an tsiopa amháin a chuir síos ar an bhfoirm iarratais

source: You must investigate who owns the shop
ga: Caithfidh tú féin a fhiosrú cé leis an siopa atá i gceist

source: You can do this by making a companies search in the Companies Registration Office
ga: Is féidir é seo a dhéanamh trí Chuardach Comhlachta a dhéanamh in Oifig Chlár na gComhlachtaí

source: Here you will find a register of all the companies in the country
ga: Anseo gheobhaidh tú liosta de na comhlachtaí uilig sa tír

source: If the shop is not registered as a company, try a business name search, also in the Companies Registration Office
ga: Muna bhfuil an siopa liostáilte mar chomhlacht is féidir leat Cuardach Ainmneacha Gnó a dhéanamh freisin san oifig seo

source: If the respondent resides outside of Ireland, you should ask them to nominate, in writing, someone in this country (usually their agent or solicitor) to accept proceedings on their behalf
ga: Má tá cónaí ar an bhfreagróir taobh amuigh den tír ba cheart a iarradh air duine éigin sa tír seo a ainmniú (aturnae nó gníomhaire) chun gníomhú agus comhfhreagras a ghlacadh ar a shon

source: In this section, you should set out the facts of your case clearly and simply
ga: Sa roinn seo ba cheart duit fíricí an cháis a leagaint amach go soiléar agus simplí

source: • When did you buy the goods/services?
ga: • Cén uair a cheannaigh tú na hearraí/seirbhísí?

source: When was your property damaged?
ga: Cén uair a ndearnadh dochar don áitreabh?

source: When did you rent the property?
ga: Cén uair a raibh an t-áitreabh tógtha ar cíos?

source: • Who is your claim against?
ga: • Cé hé an duine atá an t-éileamh ina aghaidh?

source: • How did you deal with it?
ga: • Céard a rinne tú faoi?

source: • Why are you taking court action?
ga: • Cén fáth a bhfuil tú ag tógáil gníomhaíocht cúirte?

source: • How much are you claiming for?
ga: • Cé mhéid airgid atá dhá éileamh agat?

source: It is important to include the amount for which you are claiming
ga: Tá sé tábhachtach go luann tú an méid atá a lorg agat

source: If the claim is not disputed, you may get judgement without having to go to court
ga: Muna bhfuil aon aighneasfaoin éileamh, seans go bhfaighidh tú breith gan dul chomh fada leis an gcúirt

source: Bear in mind that you can normally only claim the amount for which you are directly out of pocket, in other words, the amount you paid for the faulty goods and/or any cost involved in having them repaired
ga: Tabhair san áireamh nach bhfaighidh tú ach an méid a bhí tú as póca as an éileamh mar shampla an méid a d'íoc tú ar na hearraí lochtacha nó an méid a d'íoc tú as iad a dheisiú

source: It is therefore a good idea to keep all receipts and documentation to show what these amounts are
ga: Dá bhrí sin ba cheart duit gach admháil agus doiciméid a choinneáil mar fhianaise ar an méid atá tú as póca

source: Sometimes the Small Claims Court may allow you to claim some general damage where there was distress caused to you by a faulty product or service
ga: Uaireanta ligfidh Cúirt na n-Éileamh Beag duit damáiste ginearálta a éileamh áit ar tharla crá duit mar gheall ar sheirbhís nó táirge lochtach

source: A good example of this is where a holiday goes disastrously wrong
ga: Sampla maith de seo ná nuair a théann saoire go dona mícheart

source: You can read more about consumer rights and package holidays here
ga: Is féidir leat tuilleadh a leámh faoi chearta tomhaltóirí agus saoirí láneagraithe anseo
